#include"AVL.h"
#include<iostream>
using namespace std;
#define len 10
int main()
{
	int a[len] = {3,2,1,4,5,6,7,10,9,8};
	//int a[len] = {62,88,58,47,35,73,51,99,37,93};
	cout<<"´ý²åÈëÔªËØÐòÁÐ£º";
	for(int idx=0;idx!=len;++idx)
	{
		cout<<a[idx]<<" ";
	}
	cout<<endl;

	
	pavlNode root = nullptr;
	for(int idx=0;idx!=len;++idx)
	{
		root = AvlTreeInsertNode(root,a[idx]);  //ÒòÎªÔÚ²åÈë¹ý³ÌÖÐ»áÐÞ¸Ä¸ù½áµã
		if( nullptr == root )
			cout<<"insert "<<a[idx]<<" fail!"<<endl;
	}
	cout<<"ÖÐÐò±éÀú£º";
	inorderTraversalAVL(root);
	cout<<endl;
	cout<<"ºóÐò±éÀú£º";
	preorderTraversalAVL(root);
	cout<<endl<<endl;
	//AvlTreeDestroy(root);
	for(int idx=0;idx!=len;++idx)
	{
		if( nullptr == AvlTreeDeleteNode(root,a[idx]) && delTrue ==AvlTreeDeleteNodeErrorFlag )
			cout<<"delete "<<a[idx]<<" fail!"<<endl;
		else 
		{
			cout<<"É¾³ý"<<a[idx]<<",ÖÐÐò±éÀú£º";
			inorderTraversalAVL(root);
			cout<<endl;
			cout<<"É¾³ý"<<a[idx]<<",ºóÐò±éÀú£º";
			preorderTraversalAVL(root);
			cout<<endl<<endl;
		}
	}
}
//´ý²åÈëÔªËØÐòÁÐ£º3 2 1 4 5 6 7 10 9 8
//ÖÐÐò±éÀú£º1£¨1£© 2£¨2£© 3£¨1£© 4£¨4£© 5£¨1£© 6£¨2£© 7£¨3£© 8£¨1£© 9£¨2£© 10£¨1£©
//ºóÐò±éÀú£º4£¨4£© 2£¨2£© 1£¨1£© 3£¨1£© 7£¨3£© 6£¨2£© 5£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý3,ÖÐÐò±éÀú£º1£¨1£© 2£¨2£© 4£¨4£© 5£¨1£© 6£¨2£© 7£¨3£© 8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý3,ºóÐò±éÀú£º4£¨4£© 2£¨2£© 1£¨1£© 7£¨3£© 6£¨2£© 5£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý2,ÖÐÐò±éÀú£º1£¨1£© 4£¨3£© 5£¨1£© 6£¨2£© 7£¨4£© 8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý2,ºóÐò±éÀú£º7£¨4£© 4£¨3£© 1£¨1£© 6£¨2£© 5£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý1,ÖÐÐò±éÀú£º4£¨1£© 5£¨2£© 6£¨1£© 7£¨3£© 8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý1,ºóÐò±éÀú£º7£¨3£© 5£¨2£© 4£¨1£© 6£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý4,ÖÐÐò±éÀú£º5£¨2£© 6£¨1£© 7£¨3£© 8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý4,ºóÐò±éÀú£º7£¨3£© 5£¨2£© 6£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý5,ÖÐÐò±éÀú£º6£¨1£© 7£¨3£© 8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý5,ºóÐò±éÀú£º7£¨3£© 6£¨1£© 9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý6,ÖÐÐò±éÀú£º7£¨2£© 8£¨1£© 9£¨3£© 10£¨1£©
//É¾³ý6,ºóÐò±éÀú£º9£¨3£© 7£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý7,ÖÐÐò±éÀú£º8£¨1£© 9£¨2£© 10£¨1£©
//É¾³ý7,ºóÐò±éÀú£º9£¨2£© 8£¨1£© 10£¨1£©
//
//É¾³ý10,ÖÐÐò±éÀú£º8£¨1£© 9£¨2£©
//É¾³ý10,ºóÐò±éÀú£º9£¨2£© 8£¨1£©
//
//É¾³ý9,ÖÐÐò±éÀú£º8£¨1£©
//É¾³ý9,ºóÐò±éÀú£º8£¨1£©
//
//É¾³ý8,ÖÐÐò±éÀú£º
//É¾³ý8,ºóÐò±éÀú£º
//
//Çë°´ÈÎÒâ¼ü¼ÌÐø. . .
//
//´ý²åÈëÔªËØÐòÁÐ£º62 88 58 47 35 73 51 99 37 93
//ÖÐÐò±éÀú£º35£¨2£© 37£¨1£© 47£¨3£© 51£¨1£© 58£¨2£© 62£¨4£© 73£¨1£© 88£¨3£© 93£¨1£© 99£¨2£©
//ºóÐò±éÀú£º62£¨4£© 47£¨3£© 35£¨2£© 37£¨1£© 58£¨2£© 51£¨1£© 88£¨3£© 73£¨1£© 99£¨2£© 93£¨1£©
//
//É¾³ý62,ÖÐÐò±éÀú£º35£¨2£© 37£¨1£© 47£¨3£© 51£¨1£© 58£¨2£© 73£¨4£© 88£¨1£© 93£¨2£© 99£¨1£©
//É¾³ý62,ºóÐò±éÀú£º73£¨4£© 47£¨3£© 35£¨2£© 37£¨1£© 58£¨2£© 51£¨1£© 93£¨2£© 88£¨1£© 99£¨1£©
//
//É¾³ý88,ÖÐÐò±éÀú£º35£¨2£© 37£¨1£© 47£¨3£© 51£¨1£© 58£¨2£© 73£¨4£© 93£¨2£© 99£¨1£©
//É¾³ý88,ºóÐò±éÀú£º73£¨4£© 47£¨3£© 35£¨2£© 37£¨1£© 58£¨2£© 51£¨1£© 93£¨2£© 99£¨1£©
//
//É¾³ý58,ÖÐÐò±éÀú£º35£¨2£© 37£¨1£© 47£¨3£© 51£¨1£© 73£¨4£© 93£¨2£© 99£¨1£©
//É¾³ý58,ºóÐò±éÀú£º73£¨4£© 47£¨3£© 35£¨2£© 37£¨1£© 51£¨1£© 93£¨2£© 99£¨1£©
//
//É¾³ý47,ÖÐÐò±éÀú£º35£¨1£© 37£¨2£© 51£¨1£© 73£¨3£© 93£¨2£© 99£¨1£©
//É¾³ý47,ºóÐò±éÀú£º73£¨3£© 37£¨2£© 35£¨1£© 51£¨1£© 93£¨2£© 99£¨1£©
//
//É¾³ý35,ÖÐÐò±éÀú£º37£¨2£© 51£¨1£© 73£¨3£© 93£¨2£© 99£¨1£©
//É¾³ý35,ºóÐò±éÀú£º73£¨3£© 37£¨2£© 51£¨1£© 93£¨2£© 99£¨1£©
//
//É¾³ý73,ÖÐÐò±éÀú£º37£¨2£© 51£¨1£© 93£¨3£© 99£¨1£©
//É¾³ý73,ºóÐò±éÀú£º93£¨3£© 37£¨2£© 51£¨1£© 99£¨1£©
//
//É¾³ý51,ÖÐÐò±éÀú£º37£¨1£© 93£¨2£© 99£¨1£©
//É¾³ý51,ºóÐò±éÀú£º93£¨2£© 37£¨1£© 99£¨1£©
//
//É¾³ý99,ÖÐÐò±éÀú£º37£¨1£© 93£¨2£©
//É¾³ý99,ºóÐò±éÀú£º93£¨2£© 37£¨1£©
//
//É¾³ý37,ÖÐÐò±éÀú£º93£¨1£©
//É¾³ý37,ºóÐò±éÀú£º93£¨1£©
//
//É¾³ý93,ÖÐÐò±éÀú£º
//É¾³ý93,ºóÐò±éÀú£º
//
//Çë°´ÈÎÒâ¼ü¼ÌÐø. . .
